---
kind: other
id: AllMembers.T:Autodesk.Revit.Attributes.RegenerationAttribute
source: html/abda5e3e-1b44-c508-eab0-6fd315850c6c.htm
---
# RegenerationAttribute Members

Constructs a new RegenerationAttribute.